# **Ejercicios de pair programming M√≥dulo 2 Sprint 1**
## **Pandas: Lecci√≥n 1**
### **Dataframes y Series**

---

In [1]:
import numpy as np
import pandas as pd

1. ¬øQu√© diferencia hay entre una Serie y un DataFrame?

`Una serie consta de una √∫nica columna o fila mientras que un DataFrame consta de dos o m√°s.`

2. Momento de trabajar con Series. Contestad a las siguientes preguntas:
- Crea dos listas:
    - Una que se llame "valores" que tenga 7 n√∫meros aleatorios.
    - Otra que se llame "indices" que tenga 7 strings que se llamen como los d√≠as de la semana.

In [2]:
array_valores = np.random.randint(1, 10, (7))
valores = list(array_valores)
valores

[5, 7, 7, 3, 7, 4, 7]

In [3]:
indices = ["Lunes", "Martes", "Mi√©rcoles", "Jueves", "Viernes", "S√°bado", "Domingo"]

   - A partir de estas dos listas cread una Serie donde la variable "valores" sean los valores de la Serie y la variable indices sean los √≠ndices de la Serie.

In [4]:
serie = pd.Series(valores, index = indices)
serie

Lunes        5
Martes       7
Mi√©rcoles    7
Jueves       3
Viernes      7
S√°bado       4
Domingo      7
dtype: int64

- A partir de las dos listas anteriores cread un diccionario usando un bucle for. Para hacer esto tenemos el m√©todo zip que nos permite iterar por dos listas a la vez. M√°s informci√≥n sobre este m√©todo aqu√≠.

In [5]:
#Nuestra primera idea ha sido realizar el ejercicio de este modo que es m√°s sencillo pero que no usa el bucle for como se nos pide. Decidimos resolverlo de los dos modos.

diccionario = dict(zip(indices, valores))

diccionario

{'Lunes': 5,
 'Martes': 7,
 'Mi√©rcoles': 7,
 'Jueves': 3,
 'Viernes': 7,
 'S√°bado': 4,
 'Domingo': 7}

In [6]:
diccionario2 = {}

for x,y in zip(indices, valores):
    diccionario2.update({x:y})

diccionario2

{'Lunes': 5,
 'Martes': 7,
 'Mi√©rcoles': 7,
 'Jueves': 3,
 'Viernes': 7,
 'S√°bado': 4,
 'Domingo': 7}

- Crea una Serie con el diccionario creado en el punto anterior.

In [7]:
semana = pd.Series(diccionario2)
semana

Lunes        5
Martes       7
Mi√©rcoles    7
Jueves       3
Viernes      7
S√°bado       4
Domingo      7
dtype: int64

- ¬øQu√© forma tiene esta √∫ltima Serie?

In [8]:
semana.shape

(7,)

- ¬øQu√© tipo de datos tiene?

In [9]:
semana.dtype

dtype('int64')

- ¬øQu√© tama√±o tiene?

In [10]:
semana.size

7

- ¬øCu√°les son los √≠ndices de la Serie?

In [11]:
semana.index

Index(['Lunes', 'Martes', 'Mi√©rcoles', 'Jueves', 'Viernes', 'S√°bado',
       'Domingo'],
      dtype='object')

- ¬øY los values?

In [12]:
semana.values

array([5, 7, 7, 3, 7, 4, 7])

- Extraed el valor para el √≠ndice "lunes".

In [13]:
semana["Lunes"]

5

- Extraed el valor para el √≠ndice "lunes", "martes" y "mi√©rcoles".

In [14]:
semana["Lunes":"Mi√©rcoles"]

Lunes        5
Martes       7
Mi√©rcoles    7
dtype: int64

- Extraed el valor para el √≠ndice "lunes" y "domingo".

In [15]:
semana[["Lunes", "Domingo"]]

Lunes      5
Domingo    7
dtype: int64

3. Es el turno de los DataFrames:

- Cread un array de dos dimensiones con 4 filas y 3 columnas.

In [16]:
array = np.random.randint(1, 10, (4,3))
array

array([[9, 8, 7],
       [1, 1, 3],
       [1, 4, 9],
       [1, 1, 8]])

- Convertid el array en un DataFrame donde las columnas se llamen "Espa√±a", "Francia" e "Italia".

In [17]:
dataframe = pd.DataFrame(array, columns = ["Espa√±a", "Francia", "Italia"])
dataframe

   Espa√±a  Francia  Italia
0       9        8       7
1       1        1       3
2       1        4       9
3       1        1       8

- Descargad el archivo "medallas" y cargad el DataFrame con la siguiente l√≠nea de c√≥digo:

 ```python
        df = pd.read_csv("medallas.csv", index_col=["Pa√≠s"])
        
üìå NOTA Para evitar problemas guardar el archivo medallas.csv a la misma altura (en la misma carpeta) que el jupyter donde estamos trabajando.

In [18]:
df = pd.read_csv("data/medallas.csv", index_col=["Pa√≠s"])

In [19]:
df

                 Unnamed: 0   Oro  Plata  Bronce
Pa√≠s
China                     1  1473    994     720
Jap√≥n                     2  1032   1037     985
Corea del Sur             3   745    663     827
Ir√°n                      4   179    181     197
Kazajist√°n                5   155    158     224
India                     6   154    202     315
Tailandia                 7   132    175     278
Indonesia                 8   112    131     240
China Taip√©i              9    99    144     276
Corea del Norte          10    91    120     235

- Usando el `loc` extraed todas las columnas de la fila de Tailandia.

In [20]:
df.loc[["Tailandia"], :]

           Unnamed: 0  Oro  Plata  Bronce
Pa√≠s
Tailandia           7  132    175     278

- Usando el `loc` extraed todas las columnas de China e Ir√°n.

In [21]:
df.loc[["China Taip√©i", "Ir√°n"], :]

              Unnamed: 0  Oro  Plata  Bronce
Pa√≠s
China Taip√©i           9   99    144     276
Ir√°n                   4  179    181     197

- Usando el `loc` extraed solo las columnas de "Oro", "Plata" y "Bronce" de China e Ir√°n.

In [22]:
df.loc[["China Taip√©i", "Ir√°n"], "Oro":"Bronce"]

              Oro  Plata  Bronce
Pa√≠s
China Taip√©i   99    144     276
Ir√°n          179    181     197

- Usando el `iloc` extraed la informaci√≥n de la India. Devolved todas las columnas.

In [23]:
df

                 Unnamed: 0   Oro  Plata  Bronce
Pa√≠s
China                     1  1473    994     720
Jap√≥n                     2  1032   1037     985
Corea del Sur             3   745    663     827
Ir√°n                      4   179    181     197
Kazajist√°n                5   155    158     224
India                     6   154    202     315
Tailandia                 7   132    175     278
Indonesia                 8   112    131     240
China Taip√©i              9    99    144     276
Corea del Norte          10    91    120     235

In [24]:
df.iloc[[5], :]

       Unnamed: 0  Oro  Plata  Bronce
Pa√≠s
India           6  154    202     315

- Usando el `iloc` extraed todas las columnas de los paises que est√©n en posici√≥n impar. La primera que nos tendr√≠a que salir es Jap√≥n y la √∫ltima Corea del Norte.

In [25]:
df.iloc[1::2]

                 Unnamed: 0   Oro  Plata  Bronce
Pa√≠s
Jap√≥n                     2  1032   1037     985
Ir√°n                      4   179    181     197
India                     6   154    202     315
Indonesia                 8   112    131     240
Corea del Norte          10    91    120     235

- Utilizando el c√≥digo del ejercicio anterior, seleccionad unicamente las columnas "Oro", "Plata" y "Bronce".

In [26]:
df.iloc[1::2, 1:]

                  Oro  Plata  Bronce
Pa√≠s
Jap√≥n            1032   1037     985
Ir√°n              179    181     197
India             154    202     315
Indonesia         112    131     240
Corea del Norte    91    120     235

- Contestad a las siguientes preguntas:
    - ¬øQu√© pa√≠s consigui√≥ m√°s de 200 medallas de oro?
    - ¬øQu√© pa√≠s consigui√≥ m√°s de 200 medallas de oro y m√°s de 1000 de plata?
    - ¬øQu√© pa√≠s consigui√≥ m√°s de 200 medallas de oro o m√°s de 700 de bronce?

In [27]:
df.iloc[(list(df["Oro"] > 200)), [1]]

                Oro
Pa√≠s
China          1473
Jap√≥n          1032
Corea del Sur   745

- Como vemos hay una columna que se llama `Unnamed: 0` que no nos interesa. Eliminad esa columna.

In [28]:
df = df.drop(columns=['Unnamed: 0'])

In [29]:
df

                  Oro  Plata  Bronce
Pa√≠s
China            1473    994     720
Jap√≥n            1032   1037     985
Corea del Sur     745    663     827
Ir√°n              179    181     197
Kazajist√°n        155    158     224
India             154    202     315
Tailandia         132    175     278
Indonesia         112    131     240
China Taip√©i       99    144     276
Corea del Norte    91    120     235

- Cread una nueva columma que se llame "total" que sea el resultado de la suma de todas las medallas obtenidas por cada pa√≠s.

In [30]:
df = df.assign(Total = df['Oro'] + df['Plata'] + df['Bronce'])

In [31]:
df

                  Oro  Plata  Bronce  Total
Pa√≠s
China            1473    994     720   3187
Jap√≥n            1032   1037     985   3054
Corea del Sur     745    663     827   2235
Ir√°n              179    181     197    557
Kazajist√°n        155    158     224    537
India             154    202     315    671
Tailandia         132    175     278    585
Indonesia         112    131     240    483
China Taip√©i       99    144     276    519
Corea del Norte    91    120     235    446

In [32]:
df['Total2'] = df['Oro'] + df['Plata'] + df['Bronce']

In [33]:
df

                  Oro  Plata  Bronce  Total  Total2
Pa√≠s
China            1473    994     720   3187    3187
Jap√≥n            1032   1037     985   3054    3054
Corea del Sur     745    663     827   2235    2235
Ir√°n              179    181     197    557     557
Kazajist√°n        155    158     224    537     537
India             154    202     315    671     671
Tailandia         132    175     278    585     585
Indonesia         112    131     240    483     483
China Taip√©i       99    144     276    519     519
Corea del Norte    91    120     235    446     446